ShuangliaoRule = {
	name = "双辽麻将",
	index = GameConfig.GAME_TYPE_SHUANGLIAO,
	groups =
	{
		{
			title = "局数",
			content =
			{
				{ name = "8局", cost = "x1", pos = { 100, 0 } },
				{ name = "16局", cost = "x2", pos = { 400, 0 } },
				{ name = "32局", cost = "x4", pos = { 700, 0 } },
			},
			pos = { 0, - 60 },
			isCheckBox = false
		},
		{
			title = "玩法",
			content =
			{
				{ name = "闭门胡", pos = { 100, 0 } },
				{ name = "开门胡", pos = { 400, 0 } },
			},
			pos = { 0, - 160 },
			isCheckBox = false
		},
		{
			title = "玩法",
			content =
			{
				{ name = "四归一杠翻", pos = { 100, 0 } },
				{ name = "不翻", pos = { 400, 0 } },
			},
			pos = { 0, - 260 },
			isCheckBox = false
		},
		{
			title = "点炮",
			content =
			{
				{ name = "包三家", pos = { 100, 0 } },
			},
			pos = { 0, - 360 },
			isCheckBox = true
		}
	},
	RuleText =
	{
		"双辽麻将",
		"以双辽当地麻将规则为基础，开发的地方性麻将游戏，能让玩家体验到乐趣，让玩家在业余时间生活更丰富多彩。",
		" 一：规则介绍",
		"【游戏说明】",
		"牌数：共112张：万、条、筒各36张+红中4张。",
		"【胡牌条件】",
		" 1、胡牌不能缺幺断九，手中必须有幺或九牌。",
		" 2、胡牌手中条万筒三门不能缺少一门。",
		" 3、胡牌手中必须有碰牌。",
		" 4、红中可以代替幺九，两张红中可以代替碰牌。",
		"【算分规则】",
		"基数1计算",
		"推倒胡：满足上述胡牌条件，两张或两张以上胡牌为推倒胡，基数为2分。",
		"夹胡：满足上述胡牌条件，胡牌为一张为夹胡，基数为4分，",
		"带鸡胡：满足上述胡牌条件，手中有幺鸡，胡牌为两张或两张以上的胡牌，为鸡胡，基数为4分。",
		"鸡夹：满足上述胡牌条件，手中有一张或多张幺鸡，胡牌为一张为鸡夹，基数为8分。",
		"平飘：满足上述胡牌条件，手中所有牌型为碰牌或为蛤子的胡牌为平飘，基数为8分。",
		"鸡飘：满足上述胡牌条件，手中有幺二三条或多张幺鸡，其他为碰牌或蛤子的胡牌为鸡飘，基数为16分。",
		"以上为游戏胡牌方式为自摸的积分，如庄家胡牌或点炮翻一番，其他非庄家未点炮、非自摸基数减一番。",
		"游戏进入前可选择开门胡、闭门胡、四归一杠翻或不翻。",
		"选择闭门胡，胡牌家如为闭门，牌数基数翻一番，点炮家或自摸他家为闭门，基数翻一番，",
		"选择四归一杠翻，胡牌家产生四归一杠，胡牌翻一番，四归一杠或杠只翻一番。",
		"【杠牌介绍】",
		"四归一杠：手中吃或碰满足四张一样牌，为四归一杠牌。",
		"平杠：    由他家打出的杠牌，且不是彩虹为平杠，基数为2分。",
		"暗杠：    手中有四张一样的牌且扣下为暗杠，基数为4分。",
		"彩杠：    由他家打出的幺鸡幺筒幺万红中的杠牌为彩杠，基数为4分。",
		"彩暗杠：  手中有四张的彩杠且扣下为暗彩杠，基数为8分。",
		"为防止玩家之间作弊，对双辽麻将做出一些修改，可选择点炮责任制，一家炮付三家。",
	}
}

