PanjinRule = {
	name = "盘锦麻将",
	index=GameConfig.GAME_TYPE_PANJIN,
	groups =
	{
		{
			title = "局数",
			content =
			{
				{ name = "1圈", cost = "x1", pos = { 100, 0 } },
				{ name = "2圈", cost = "x2", pos = { 400, 0 } },
				{ name = "4圈", cost = "x4", pos = { 700, 0 } },
			},
			pos = { 0, - 60 },
			isCheckBox = false
		},
		{
			title = "玩法",
			content =
			{
				{ name = "穷胡", pos = { 100, 0 } },
				{ name = "128番封顶", pos = { 400, 0 } },
				{ name = "包三家", pos = { 100, - 60 } },
				{ name = "加钢", pos = { 400, - 60 } },
				{ name = "会牌", pos = { 100, - 120 } },
				{ name = "买断门", pos = { 400, - 120 } },
				{ name = "鸡胡", pos = { 100, - 180 } },
			},
			pos = { 0, - 160 },
			isCheckBox = true
		}
	},
	RuleText =
	{
		"盘锦麻将",
		"一：规则介绍",
		"【游戏说明】",
		"牌数：共136张：万、条、筒、东、南、西、北、中、发、白。",
		"庄家：游戏中采用连庄方式，仅第一局为系统随机定庄，之后将由本局胡牌的玩家下局坐庄，如庄家胡牌，则继续连庄。如出现和牌，则庄家的下家上庄。",
		"摸牌：游戏在一开始，只有庄家可得到十四张牌，其余的人十三张。庄家从牌中选出一张最无用的牌丢出。此时，其它三家都有权力要那张丢出的牌。",
		"【胡牌条件】",
		"1、没有买断门时三门齐：有万牌、条牌、筒牌才能胡牌(买断门时只能有两门)",
		"2、有幺九（混不顶幺）：胡牌时至少有一张幺九牌，东南西北中发白也可以算作幺九牌",
		"3、有平胡：胡牌时至少有一刻子或杠，或有东西南北中发白一对。（刻子：三张一样的牌）",
		"4、已开门",
		"【特殊玩法】",
		"1、混牌：可以替代其它任意一张牌。",
		"2、买断门：由庄家选择是否买断门，买断门后，手中只有两门才能胡牌。",
		"3、加钢：在游戏开始前，玩家可以选择是否加钢，加钢后，无论输赢都加1番",
		"【算分规则】",
		"胡牌分数与杠牌分数分开计算。",
		"一、胡牌分数：如果点炮，只有点炮玩家赔给胡牌家应付的分，如果自摸，三家都赔给胡牌家应付的分",
		"付分公式：付分= 2的总番数次方*房间基础分（即番数每增加一番，付分都要在前一番数基础上*2）",
		"番数列表：",
		"1、庄家：1番",
		"2、点炮：1番",
		"3、自摸：1番",
		"4、买断门：1番",
		"5、加钢：1番",
		"6、飘胡：2番（飘胡：又称对对胡/碰碰胡，一副对子做将，其它全部由刻子或杠组成的胡牌）",
		"二、 杠牌分数：结算时，三家都要赔给杠牌家应付的分（杠牌家没有胡牌另外三家也要赔）",
		"1、明杠：1倍基础分",
		"2、暗杠：2倍基础分",
		"3、所有杠累积做加法计算",
	}
}

